label finale:
    scene black
    with pixellate
    "Годы  спустя..."

    scene final_oleg_university
    with fade

    "После той знаменательной встречи жизнь Олега кардинально изменилась. Он перестал 
    тратить время на World of cars, ведь теперь все его мысли занимало поступление на 
    специальность мечты." 
    "Мама, наблюдающая такое рвение сына к знаниям сначала 
    обеспокоилась, но, убедившись, что у Олега всё в порядке, стала очень рада за сына."
    "Весь год Олег готовился не покладая рук и наконец поступил на заветную специальность. Обучаться 
    было интересно и весело, так как на всем пути обучения ему помогали Сергей, Ден и Света." 
    "За этот короткий, но насыщенный промежуток времени они стали настоящей семьей."

    scene final_oleg_work
    with dissolve

    "Потом началась работа и появилось много возможностей для реализации своего потенциала. 
    Различные задачи, повышение квалификации, конференции и совещания сделали Олега 
    настоящим профессионалом в своем деле." 
    "И вот, сидя за очередным проектом, Олег увидел 
    на телефоне уведомление о пятилетии с момента поступления в институт. Нахлынули 
    воспоминания, вызывая улыбку на лице, еще недавно сосредоточенном на работе." 
    "Он был благодарен всему, что произошло с ним тем летом в конце 10 класса. И особенно тем 
    хакерам, что взломали его карту, когда он хотел купить новую машину в World of Cars…"

    scene black
    with fade
    "Конец"

    return